In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/SoongMoo/soldesk2110/main/data/scientists.csv")
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [11]:
print(df['Age'])
print(df['Age'].mean())
#### 평균나이보다 많은 사람을 출력하시오.
# 마스킹
df[df['Age'] > df['Age'].mean()]
# 마스크
df['Age'] > df['Age'].mean()
df[[False,True,True,True,False,False,False,True]]
df['Age'][df['Age'] > df['Age'].mean()]

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
59.125

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [24]:
df
#df.info(df['Died'] - df['Born'])
Born = pd.to_datetime(df['Born'], format='%Y-%m-%d')# 1999-12-10
# pd.to_datetime(19991210, format='%Y%m%d')
Died = pd.to_datetime(df['Died'], format='%Y-%m-%d')
df['Born_dt'] , df['Died_dt'] = Born, Died
df
df.info()
df['age_days_dt'] = (Died - Born) / 365

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   Born_dt     8 non-null      datetime64[ns]
 6   Died_dt     8 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 576.0+ bytes

In [27]:
### DataFrame에 있는 데이터를 파일에 저장
df.to_csv("df.csv")
df.to_csv("df.tsv" , sep="\t")
df.to_csv("df1.csv", index=False)

In [28]:
import xlwt
df.to_excel('df.xls')

C:\Users\SCOOL\AppData\Local\Temp\ipykernel_9532\2880873007.py:2: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel('df.xls')

In [30]:
import openpyxl
df.to_excel('df.xlsx')

In [31]:
df.to_excel('df1.xlsx',index=False)

In [33]:
df = df.drop(['Born_dt', 'Died_dt', 'age_days_dt'], axis = 1)
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [34]:
df = df.drop([1,3,5], axis = 0)
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician